{"backend": "tensorflow", "keras_version": "2.1.5", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 101, 80, 1], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_1", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_2", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_3", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_4", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_5", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [2, 2]}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_6", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [2, 2]}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_7", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [2, 2]}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["add_2", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_8", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [4, 4]}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_9", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [4, 4]}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_10", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [4, 4]}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_11", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [8, 8]}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_12", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [8, 8]}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_14", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [8, 8]}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_13", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [8, 8]}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_15", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [8, 8]}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_16", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [16, 16]}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "linear", "filters": 45, "name": "conv2d_18", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [16, 16]}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"scale": false, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "center": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "global_max_pooling2d_1", "class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_1", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "global_average_pooling2d_3", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_3", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "global_max_pooling2d_2", "class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_2", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [1, 1, 45], "trainable": true}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"name": "reshape_2", "target_shape": [1, 1, 45], "trainable": true}, "inbound_nodes": [[["global_max_pooling2d_1", 0, 0, {}]]]}, {"name": "reshape_3", "class_name": "Reshape", "config": {"name": "reshape_3", "target_shape": [1, 1, 45], "trainable": true}, "inbound_nodes": [[["global_average_pooling2d_3", 0, 0, {}]]]}, {"name": "reshape_4", "class_name": "Reshape", "config": {"name": "reshape_4", "target_shape": [1, 1, 45], "trainable": true}, "inbound_nodes": [[["global_max_pooling2d_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_regularizer": null, "units": 5, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["reshape_1", 0, 0, {}]], [["reshape_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_regularizer": null, "units": 5, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["reshape_3", 0, 0, {}]], [["reshape_4", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_regularizer": null, "units": 45, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_1", 1, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_regularizer": null, "units": 45, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dense_3", 0, 0, {}]], [["dense_3", 1, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_2", 1, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_4", 1, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_15", "trainable": true}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_16", "trainable": true}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}], ["activation_15", 0, 0, {}]]]}, {"name": "multiply_3", "class_name": "Multiply", "config": {"name": "multiply_3", "trainable": true}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {}, "output_shape": null, "trainable": true, "function_type": "lambda", "name": "lambda_1", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxkAAAB0AABqAQB8AABkAQBkAgBkAwBkBACDAQJTKQVO2gRh\neGlz6QMAAADaCGtlZXBkaW1zVCkC2gFL2gRtZWFuKQHaAXipAHIHAAAA+hwvaG9tZS9haXhpbi9L\nV1MvQ29kZS9DQkFNLnB52gg8bGFtYmRhPk8AAADzAAAAAA==\n", null, null]}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {}, "output_shape": null, "trainable": true, "function_type": "lambda", "name": "lambda_2", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxkAAAB0AABqAQB8AABkAQBkAgBkAwBkBACDAQJTKQVO2gRh\neGlz6QMAAADaCGtlZXBkaW1zVCkC2gFL2gNtYXgpAdoBeKkAcgcAAAD6HC9ob21lL2FpeGluL0tX\nUy9Db2RlL0NCQU0ucHnaCDxsYW1iZGE+UQAAAPMAAAAA\n", null, null]}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {}, "output_shape": null, "trainable": true, "function_type": "lambda", "name": "lambda_3", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxkAAAB0AABqAQB8AABkAQBkAgBkAwBkBACDAQJTKQVO2gRh\neGlz6QMAAADaCGtlZXBkaW1zVCkC2gFL2gRtZWFuKQHaAXipAHIHAAAA+hwvaG9tZS9haXhpbi9L\nV1MvQ29kZS9DQkFNLnB52gg8bGFtYmRhPk8AAADzAAAAAA==\n", null, null]}, "inbound_nodes": [[["multiply_3", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {}, "output_shape": null, "trainable": true, "function_type": "lambda", "name": "lambda_4", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxkAAAB0AABqAQB8AABkAQBkAgBkAwBkBACDAQJTKQVO2gRh\neGlz6QMAAADaCGtlZXBkaW1zVCkC2gFL2gNtYXgpAdoBeKkAcgcAAAD6HC9ob21lL2FpeGluL0tX\nUy9Db2RlL0NCQU0ucHnaCDxsYW1iZGE+UQAAAPMAAAAA\n", null, null]}, "inbound_nodes": [[["multiply_3", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": 3}, "inbound_nodes": [[["lambda_1", 0, 0, {}], ["lambda_2", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": 3}, "inbound_nodes": [[["lambda_3", 0, 0, {}], ["lambda_4", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [7, 7], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "sigmoid", "filters": 1, "name": "conv2d_17", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [7, 7], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "sigmoid", "filters": 1, "name": "conv2d_19", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "multiply_2", "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true}, "inbound_nodes": [[["multiply_1", 0, 0, {}], ["conv2d_17", 0, 0, {}]]]}, {"name": "multiply_4", "class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true}, "inbound_nodes": [[["multiply_3", 0, 0, {}], ["conv2d_19", 0, 0, {}]]]}, {"name": "global_average_pooling2d_2", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_2", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["multiply_2", 0, 0, {}]]]}, {"name": "global_average_pooling2d_4", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_4", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["multiply_4", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_regularizer": null, "units": 11, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["global_average_pooling2d_2", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_regularizer": null, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "name": "dense_6", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["global_average_pooling2d_4", 0, 0, {}]]]}, {"name": "keyword_spotting", "class_name": "Activation", "config": {"activation": "softmax", "name": "keyword_spotting", "trainable": true}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "own_voice_detection", "class_name": "Activation", "config": {"activation": "sigmoid", "name": "own_voice_detection", "trainable": true}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["keyword_spotting", 0, 0], ["own_voice_detection", 0, 0]]}, "class_name": "Model"}